Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/pic32cm5112sg00100.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M23 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void SVCall_Handler                ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void FCR_Handler                   ( void );
void FCW_Handler                   ( void );
void PM_Handler                    ( void );
void SUPC_Handler                  ( void );
void OSCCTRL_XOSCRDY_Handler       ( void );
void OSCCTRL_DFLLRDY_Handler       ( void );
void OSCCTRL_PLLLOCKR_0_Handler    ( void );
void OSC32KCTRL_XOSC32KRDY_Handler ( void );
void OSC32KCTRL_XOSC32KFAIL_Handler( void );
void MCLK_Handler                  ( void );
void FREQM_Handler                 ( void );
void WDT_Handler                   ( void );
void RTC_TAMPER_Handler            ( void );
void RTC_OVF_Handler               ( void );
void RTC_PER0_Handler              ( void );
void RTC_CMP0_Handler              ( void );
void EIC_EXTINT0_Handler           ( void );
void EIC_EXTINT1_Handler           ( void );
void EIC_EXTINT2_Handler           ( void );
void EIC_EXTINT3_Handler           ( void );
void EIC_EXTINT4_Handler           ( void );
void EIC_EXTINT5_Handler           ( void );
void EIC_EXTINT6_Handler           ( void );
void EIC_EXTINT7_Handler           ( void );
void EIC_EXTINT8_Handler           ( void );
void EIC_EXTINT9_Handler           ( void );
void EIC_EXTINT10_Handler          ( void );
void EIC_EXTINT11_Handler          ( void );
void EIC_EXTINT12_Handler          ( void );
void EIC_EXTINT13_Handler          ( void );
void EIC_EXTINT14_Handler          ( void );
void EIC_EXTINT15_Handler          ( void );
void EIC_NSCHK_Handler             ( void );
void TRAM_Handler                  ( void );
void MCRAMC_Handler                ( void );
void CAN0_INT0_Handler             ( void );
void CAN0_INT1_Handler             ( void );
void CAN0_BERR_Handler             ( void );
void CAN1_INT0_Handler             ( void );
void CAN1_INT1_Handler             ( void );
void CAN1_BERR_Handler             ( void );
void PORT_Handler                  ( void );
void DMAC_TCMPL0_Handler           ( void );
void DMAC_TCMPL1_Handler           ( void );
void DMAC_TCMPL2_Handler           ( void );
void DMAC_TCMPL3_Handler           ( void );
void DMAC_TCMPL4_Handler           ( void );
void HMATRIX2_Handler              ( void );
void EVSYS_EVD0_Handler            ( void );
void EVSYS_EVD1_Handler            ( void );
void EVSYS_EVD2_Handler            ( void );
void EVSYS_EVD3_Handler            ( void );
void EVSYS_EVD4_Handler            ( void );
void EVSYS_EVD5_Handler            ( void );
void EVSYS_EVD6_Handler            ( void );
void EVSYS_EVD7_Handler            ( void );
void EVSYS_EVD8_Handler            ( void );
void EVSYS_EVD9_Handler            ( void );
void EVSYS_EVD10_Handler           ( void );
void EVSYS_EVD11_Handler           ( void );
void SERCOM0_6_Handler             ( void );
void SERCOM0_5_Handler             ( void );
void SERCOM0_0_Handler             ( void );
void SERCOM0_1_Handler             ( void );
void SERCOM0_2_Handler             ( void );
void SERCOM0_3_Handler             ( void );
void SERCOM0_4_Handler             ( void );
void SERCOM1_6_Handler             ( void );
void SERCOM1_5_Handler             ( void );
void SERCOM1_0_Handler             ( void );
void SERCOM1_1_Handler             ( void );
void SERCOM1_2_Handler             ( void );
void SERCOM1_3_Handler             ( void );
void SERCOM1_4_Handler             ( void );
void SERCOM2_6_Handler             ( void );
void SERCOM2_5_Handler             ( void );
void SERCOM2_0_Handler             ( void );
void SERCOM2_1_Handler             ( void );
void SERCOM2_2_Handler             ( void );
void SERCOM2_3_Handler             ( void );
void SERCOM2_4_Handler             ( void );
void SERCOM3_6_Handler             ( void );
void SERCOM3_5_Handler             ( void );
void SERCOM3_0_Handler             ( void );
void SERCOM3_1_Handler             ( void );
void SERCOM3_2_Handler             ( void );
void SERCOM3_3_Handler             ( void );
void SERCOM3_4_Handler             ( void );
void TCC0_DFS_Handler              ( void );
void TCC0_CNT_Handler              ( void );
void TCC0_MC0_Handler              ( void );
void TCC0_MC1_Handler              ( void );
void TCC1_DFS_Handler              ( void );
void TCC1_CNT_Handler              ( void );
void TCC1_MC0_Handler              ( void );
void TCC1_MC1_Handler              ( void );
void TCC2_DFS_Handler              ( void );
void TCC2_CNT_Handler              ( void );
void TCC2_MC0_Handler              ( void );
void TCC2_MC1_Handler              ( void );
void TCC3_DFS_Handler              ( void );
void TCC3_CNT_Handler              ( void );
void TCC3_MC0_Handler              ( void );
void TCC3_MC1_Handler              ( void );
void SERCOM4_6_Handler             ( void );
void SERCOM4_5_Handler             ( void );
void SERCOM4_0_Handler             ( void );
void SERCOM4_1_Handler             ( void );
void SERCOM4_2_Handler             ( void );
void SERCOM4_3_Handler             ( void );
void SERCOM4_4_Handler             ( void );
void SERCOM5_6_Handler             ( void );
void SERCOM5_5_Handler             ( void );
void SERCOM5_0_Handler             ( void );
void SERCOM5_1_Handler             ( void );
void SERCOM5_2_Handler             ( void );
void SERCOM5_3_Handler             ( void );
void SERCOM5_4_Handler             ( void );
void TCC4_DFS_Handler              ( void );
void TCC4_CNT_Handler              ( void );
void TCC4_MC0_Handler              ( void );
void TCC4_MC1_Handler              ( void );
void TCC5_DFS_Handler              ( void );
void TCC5_CNT_Handler              ( void );
void TCC5_MC0_Handler              ( void );
void TCC5_MC1_Handler              ( void );
void TCC6_DFS_Handler              ( void );
void TCC6_CNT_Handler              ( void );
void TCC6_MC0_Handler              ( void );
void TCC6_MC1_Handler              ( void );
void ADC_REQ0_Handler              ( void );
void ADC_REQ1_Handler              ( void );
void AC_Handler                    ( void );
void PTC_Handler                   ( void );
void USB_EORSMDNRSM_Handler        ( void );
void USB_SOFHSOF_Handler           ( void );
void USB_TRCPT00_Handler           ( void );
void USB_TRCPT10_Handler           ( void );
void AT_Handler                    ( void );
void HSM_Handler                   ( void );
void PUF_Handler                   ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M23 Processor and Core Peripherals */
#define __CM23_REV                    0x0000 /* Cortex-M23 Core Revision                                                  */
#define __FPU_PRESENT                      0 /* No FPU                                                                    */
#define __MPU_PRESENT                      1 /* MPU implemented                                                           */
#define __NVIC_PRIO_BITS                   2 /* Number of NVIC Priority Bits                                              */
#define __SAUREGION_PRESENT                0 /* Number of Security Attribute Unit Regions (No SAU)                        */
#define __VTOR_PRESENT                     1 /* Include Vector Table Offset Register                                      */
#define __Vendor_SysTickConfig             0 /* Standard SYSTICK used                                                     */
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

